FreeRTOS/FreeRTOS/Demo/lwIP_AVR32_UC3/NETWORK/EMAC/AVR32_EMAC.c
        /* Is this the last data for the frame? */
        if( lEndOfFrame && ( ulDataBuffered >= ulLength ) )
        {
          /* No more data remains for this frame so we can start the
          transmission. */
          ulLastBuffer = AVR32_LAST_BUFFER;
        }
        else
        {
          /* More data to come for this frame. */
          ulLastBuffer = 0;
        }
  
        /* Fill out the necessary in the descriptor to get the data sent,
        then move to the next descriptor, wrapping if necessary. */
        if( uxTxBufferIndex >= ( NB_TX_BUFFERS - 1 ) )
        {
          xTxDescriptors[ uxTxBufferIndex ].U_Status.status =   ( ulLengthToSend & ( unsigned portLONG ) AVR32_LENGTH_FRAME )
                                      | ulLastBuffer
                                      | AVR32_TRANSMIT_WRAP;
          uxTxBufferIndex = 0;
        }
        else
        {
          xTxDescriptors[ uxTxBufferIndex ].U_Status.status =   ( ulLengthToSend & ( unsigned portLONG ) AVR32_LENGTH_FRAME )
                                      | ulLastBuffer;
          uxTxBufferIndex++;
        }
  
        /* If this is the last buffer to be sent for this frame we can
        start the transmission. */
        if( ulLastBuffer )
        {
          AVR32_MACB.ncr |=  AVR32_MACB_TSTART_MASK;
        }
      }
      portEXIT_CRITICAL();
    }
    else
    {
      break;
    }
  }

  return lReturn;
}
/*-----------------------------------------------------------*/

/* See the header file for descriptions of public functions. */
unsigned portLONG ulEMACInputLength( void )
{
register unsigned portLONG ulIndex , ulLength = 0;

  /* Skip any fragments.  We are looking for the first buffer that contains
  data and has the SOF (start of frame) bit set. */
  while( ( xRxDescriptors[ ulNextRxBuffer ].addr & AVR32_OWNERSHIP_BIT ) && !( xRxDescriptors[ ulNextRxBuffer ].U_Status.status & AVR32_SOF ) )
  {
    /* Ignoring this buffer.  Mark it as free again. */
    xRxDescriptors[ ulNextRxBuffer ].addr &= ~( AVR32_OWNERSHIP_BIT );
    ulNextRxBuffer++;
    if( ulNextRxBuffer >= NB_RX_BUFFERS )
    {
      ulNextRxBuffer = 0;
    }
  }

  /* We are going to walk through the descriptors that make up this frame,
  but don't want to alter ulNextRxBuffer as this would prevent vEMACRead()
  from finding the data.  Therefore use a copy of ulNextRxBuffer instead. */
  ulIndex = ulNextRxBuffer;
  /* Walk through the descriptors until we find the last buffer for this
  frame.  The last buffer will give us the length of the entire frame. */
  while( ( xRxDescriptors[ ulIndex ].addr & AVR32_OWNERSHIP_BIT ) && !ulLength )
  {
    ulLength = xRxDescriptors[ ulIndex ].U_Status.status & AVR32_LENGTH_FRAME;
    /* Increment to the next buffer, wrapping if necessary. */
    ulIndex++;
    if( ulIndex >= NB_RX_BUFFERS )
    {
      ulIndex = 0;
    }
  }
  return ulLength;
}
/*-----------------------------------------------------------*/

/* See the header file for descriptions of public functions. */
void vEMACRead( portCHAR *pcTo, unsigned portLONG ulSectionLength, unsigned portLONG ulTotalFrameLength )
{
static unsigned portLONG ulSectionBytesReadSoFar = 0, ulBufferPosition = 0, ulFameBytesReadSoFar = 0;
static portCHAR *pcSource;
register unsigned portLONG ulBytesRemainingInBuffer, ulRemainingSectionBytes;

  /* Read ulSectionLength bytes from the Rx buffers.  This is not necessarily any
  correspondence between the length of our Rx buffers, and the length of the
  data we are returning or the length of the data being requested.  Therefore,
  between calls  we have to remember not only which buffer we are currently
  processing, but our position within that buffer.  This would be greatly
  simplified if PBUF_POOL_BUFSIZE could be guaranteed to be greater than
  the size of each Rx buffer, and that memory fragmentation did not occur.
  
  This function should only be called after a call to ulEMACInputLength().
  This will ensure ulNextRxBuffer is set to the correct buffer. */


  /* vEMACRead is called with pcTo set to NULL to indicate that we are about
  to read a new frame.  Any fragments remaining in the frame we were
  processing during the last call should be dropped. */
  if( pcTo == NULL )
  {
    /* How many bytes are indicated as being in this buffer?  If none then
    the buffer is completely full and the frame is contained within more
    than one buffer. */
    /* Reset our state variables ready for the next read from this buffer. */
        pcSource = ( portCHAR * )( xRxDescriptors[ ulNextRxBuffer ].addr & emacADDRESS_MASK );
        ulFameBytesReadSoFar = ( unsigned portLONG ) 0;
    ulBufferPosition = ( unsigned portLONG ) 0;
  }
  else
  {
    /* Loop until we have obtained the required amount of data. */
    ulSectionBytesReadSoFar = 0;
    while( ulSectionBytesReadSoFar < ulSectionLength )
    {
      /* We may have already read some data from this buffer.  How much
      data remains in the buffer? */
      ulBytesRemainingInBuffer = ( ETH_RX_BUFFER_SIZE - ulBufferPosition );

      /* How many more bytes do we need to read before we have the
      required amount of data? */
      ulRemainingSectionBytes = ulSectionLength - ulSectionBytesReadSoFar;

      /* Do we want more data than remains in the buffer? */
      if( ulRemainingSectionBytes > ulBytesRemainingInBuffer )
      {
        /* We want more data than remains in the buffer so we can
        write the remains of the buffer to the destination, then move
        onto the next buffer to get the rest. */
        memcpy( &( pcTo[ ulSectionBytesReadSoFar ] ), &( pcSource[ ulBufferPosition ] ), ulBytesRemainingInBuffer );
        ulSectionBytesReadSoFar += ulBytesRemainingInBuffer;
        ulFameBytesReadSoFar += ulBytesRemainingInBuffer;

        /* Mark the buffer as free again. */
        xRxDescriptors[ ulNextRxBuffer ].addr &= ~( AVR32_OWNERSHIP_BIT );
        /* Move onto the next buffer. */
        ulNextRxBuffer++;
        if( ulNextRxBuffer >= NB_RX_BUFFERS )
        {
          ulNextRxBuffer = ( unsigned portLONG ) 0;
        }

