FreeRTOS/FreeRTOS/Demo/lwIP_AVR32_UC3/NETWORK/EMAC/AVR32_EMAC.c
        /* Reset the variables for the new buffer. */
        pcSource = ( portCHAR * )( xRxDescriptors[ ulNextRxBuffer ].addr & emacADDRESS_MASK );
        ulBufferPosition = ( unsigned portLONG ) 0;
      }
      else
      {
        /* We have enough data in this buffer to send back.  Read out
        enough data and remember how far we read up to. */
        memcpy( &( pcTo[ ulSectionBytesReadSoFar ] ), &( pcSource[ ulBufferPosition ] ), ulRemainingSectionBytes );

        /* There may be more data in this buffer yet.  Increment our
        position in this buffer past the data we have just read. */
        ulBufferPosition += ulRemainingSectionBytes;
        ulSectionBytesReadSoFar += ulRemainingSectionBytes;
        ulFameBytesReadSoFar += ulRemainingSectionBytes;

        /* Have we now finished with this buffer? */
        if( ( ulBufferPosition >= ETH_RX_BUFFER_SIZE ) || ( ulFameBytesReadSoFar >= ulTotalFrameLength ) )
        {
          /* Mark the buffer as free again. */
          xRxDescriptors[ ulNextRxBuffer ].addr &= ~( AVR32_OWNERSHIP_BIT );
          /* Move onto the next buffer. */
          ulNextRxBuffer++;
          if( ulNextRxBuffer >= NB_RX_BUFFERS )
          {
            ulNextRxBuffer = 0;
          }
          pcSource = ( portCHAR * )( xRxDescriptors[ ulNextRxBuffer ].addr & emacADDRESS_MASK );
          ulBufferPosition = 0;
        }
      }
    }
  }
}
/*-----------------------------------------------------------*/
void vEMACSetMACAddress(const portCHAR * EMACAddress)
{
  memcpy(cMACAddress, EMACAddress, sizeof(cMACAddress));
}

/* See the header file for descriptions of public functions. */
xSemaphoreHandle xEMACInit( void )
{
unsigned long status;

  /* enable GPIO's */
  gpio_enable_module_pin(AVR32_MACB_TX_CLK_0_PIN, AVR32_MACB_TX_CLK_0_FUNCTION); //PB0
  gpio_enable_module_pin(AVR32_MACB_TX_EN_0_PIN, AVR32_MACB_TX_EN_0_FUNCTION);   //PB1
  gpio_enable_module_pin(AVR32_MACB_TXD_0_PIN, AVR32_MACB_TXD_0_FUNCTION);       //PB2
  gpio_enable_module_pin(AVR32_MACB_TXD_1_PIN, AVR32_MACB_TXD_1_FUNCTION);       //PB3

  gpio_enable_module_pin(AVR32_MACB_RXD_0_PIN, AVR32_MACB_RXD_0_FUNCTION);       //PB5
  gpio_enable_module_pin(AVR32_MACB_RXD_1_PIN, AVR32_MACB_RXD_1_FUNCTION);       //PB6
  gpio_enable_module_pin(AVR32_MACB_RX_ER_0_PIN, AVR32_MACB_RX_ER_0_FUNCTION);   //PB7
  gpio_enable_module_pin(AVR32_MACB_MDC_0_PIN, AVR32_MACB_MDC_0_FUNCTION);       //PB8
  gpio_enable_module_pin(AVR32_MACB_MDIO_0_PIN, AVR32_MACB_MDIO_0_FUNCTION);     //PB9

  gpio_enable_module_pin(AVR32_MACB_RX_DV_0_PIN, AVR32_MACB_RX_DV_0_FUNCTION);   //PB15


  /* set up registers */
  AVR32_MACB.ncr = 0;
  AVR32_MACB.tsr = ~0UL;
  AVR32_MACB.rsr = ~0UL;
  AVR32_MACB.idr = ~0UL;
  status = AVR32_MACB.isr;


#ifndef USE_RMII_INTERFACE
  // RMII not used, set 1 to the USRIO Register
  AVR32_MACB.usrio |= AVR32_MACB_RMII_MASK;
#else
  // RMII used, set 0 to the USRIO Register
  AVR32_MACB.usrio &= ~AVR32_MACB_RMII_MASK;
#endif

  /* Load our MAC address into the EMAC. */
  prvSetupMACAddress();

  /* Setup the buffers and descriptors. */
  prvSetupDescriptors();

#if configCPU_CLOCK_HZ <= 20000000
  AVR32_MACB.ncfgr |= (AVR32_MACB_NCFGR_CLK_DIV8 << AVR32_MACB_NCFGR_CLK_OFFSET);
#elif configCPU_CLOCK_HZ <= 40000000
  AVR32_MACB.ncfgr |= (AVR32_MACB_NCFGR_CLK_DIV16 << AVR32_MACB_NCFGR_CLK_OFFSET);
#elif configCPU_CLOCK_HZ <= 80000000
  AVR32_MACB.ncfgr |= AVR32_MACB_NCFGR_CLK_DIV32 << AVR32_MACB_NCFGR_CLK_OFFSET;
#elif configCPU_CLOCK_HZ <= 160000000
  AVR32_MACB.ncfgr |= AVR32_MACB_NCFGR_CLK_DIV64 << AVR32_MACB_NCFGR_CLK_OFFSET;
#else
# error System clock too fast
#endif

  /* Are we connected? */
  if( prvProbePHY() )
  {
    /* Enable the interrupt! */
    portENTER_CRITICAL();
    {
      prvSetupEMACInterrupt();
      vPassEMACSemaphore( xSemaphore );
    }
    portEXIT_CRITICAL();
    /* Enable Rx and Tx, plus the stats register. */
    AVR32_MACB.ncr = AVR32_MACB_NCR_TE_MASK | AVR32_MACB_NCR_RE_MASK;
  }
  return xSemaphore;
}

/* See the header file for descriptions of public functions. */
void vClearEMACTxBuffer( void )
{
static unsigned portBASE_TYPE uxNextBufferToClear = 0;

  /* Called on Tx interrupt events to set the AT91C_TRANSMIT_OK bit in each
  Tx buffer within the frame just transmitted.  This marks all the buffers
  as available again.

  The first buffer in the frame should have the bit set automatically. */
  if( xTxDescriptors[ uxNextBufferToClear ].U_Status.status & AVR32_TRANSMIT_OK )
  {
    /* Loop through the other buffers in the frame. */
    while( !( xTxDescriptors[ uxNextBufferToClear ].U_Status.status & AVR32_LAST_BUFFER ) )
    {
      uxNextBufferToClear++;

      if( uxNextBufferToClear >= NB_TX_BUFFERS )
      {
        uxNextBufferToClear = 0;
      }

      xTxDescriptors[ uxNextBufferToClear ].U_Status.status |= AVR32_TRANSMIT_OK;
    }

    /* Start with the next buffer the next time a Tx interrupt is called. */
    uxNextBufferToClear++;

    /* Do we need to wrap back to the first buffer? */
    if( uxNextBufferToClear >= NB_TX_BUFFERS )
    {
      uxNextBufferToClear = 0;
    }
  }
}
/*-----------------------------------------------------------*/

static void prvSetupDescriptors(void)
{
unsigned portBASE_TYPE xIndex;
unsigned portLONG ulAddress;

  /* Initialise xRxDescriptors descriptor. */
  for( xIndex = 0; xIndex < NB_RX_BUFFERS; ++xIndex )
  {
    /* Calculate the address of the nth buffer within the array. */
    ulAddress = ( unsigned portLONG )( pcRxBuffer + ( xIndex * ETH_RX_BUFFER_SIZE ) );

    /* Write the buffer address into the descriptor.  The DMA will place
    the data at this address when this descriptor is being used.  Mask off
    the bottom bits of the address as these have special meaning. */
    xRxDescriptors[ xIndex ].addr = ulAddress & emacADDRESS_MASK;
  }

