FreeRTOS/FreeRTOS/Demo/lwIP_AVR32_UC3/NETWORK/EMAC/AVR32_EMAC.c
  /* The last buffer has the wrap bit set so the EMAC knows to wrap back
  to the first buffer. */
  xRxDescriptors[ NB_RX_BUFFERS - 1 ].addr |= emacRX_WRAP_BIT;

  /* Initialise xTxDescriptors. */
  for( xIndex = 0; xIndex < NB_TX_BUFFERS; ++xIndex )
  {
    /* Calculate the address of the nth buffer within the array. */
    ulAddress = ( unsigned portLONG )( pcTxBuffer + ( xIndex * ETH_TX_BUFFER_SIZE ) );

    /* Write the buffer address into the descriptor.  The DMA will read
    data from here when the descriptor is being used. */
    xTxDescriptors[ xIndex ].addr = ulAddress & emacADDRESS_MASK;
    xTxDescriptors[ xIndex ].U_Status.status = AVR32_TRANSMIT_OK;
  }

  /* The last buffer has the wrap bit set so the EMAC knows to wrap back
  to the first buffer. */
  xTxDescriptors[ NB_TX_BUFFERS - 1 ].U_Status.status = AVR32_TRANSMIT_WRAP | AVR32_TRANSMIT_OK;

  /* Tell the EMAC where to find the descriptors. */
  AVR32_MACB.rbqp =   ( unsigned portLONG )xRxDescriptors;
  AVR32_MACB.tbqp =   ( unsigned portLONG )xTxDescriptors;

  /* Enable the copy of data into the buffers, ignore broadcasts,
  and don't copy FCS. */
  AVR32_MACB.ncfgr |= (AVR32_MACB_CAF_MASK |  AVR32_MACB_NBC_MASK | AVR32_MACB_NCFGR_DRFCS_MASK);

} 
/*-----------------------------------------------------------*/

static void prvSetupMACAddress( void )
{
  /* Must be written SA1L then SA1H. */
  AVR32_MACB.sa1b =  ( ( unsigned portLONG ) cMACAddress[ 3 ] << 24 ) |
                     ( ( unsigned portLONG ) cMACAddress[ 2 ] << 16 ) |
                     ( ( unsigned portLONG ) cMACAddress[ 1 ] << 8  ) |
                                             cMACAddress[ 0 ];

  AVR32_MACB.sa1t =  ( ( unsigned portLONG ) cMACAddress[ 5 ] << 8 ) |
                                             cMACAddress[ 4 ];
}
/*-----------------------------------------------------------*/

static void prvSetupEMACInterrupt( void )
{
  /* Create the semaphore used to trigger the EMAC task. */
  if (xSemaphore == NULL)
  {
    vSemaphoreCreateBinary( xSemaphore );
  }

  if( xSemaphore )
  {
    /* We start by 'taking' the semaphore so the ISR can 'give' it when the
    first interrupt occurs. */
    xSemaphoreTake( xSemaphore, emacNO_DELAY );
    portENTER_CRITICAL();
    {
    /* Setup the interrupt for USART0.
       Register the USART0 interrupt handler to the interrupt controller
       at interrupt level 2. */
    INTC_register_interrupt(&vEMAC_ISR, AVR32_MACB_IRQ, INT2);

    /* We want to interrupt on Rx and Tx events. */
    AVR32_MACB.ier = AVR32_MACB_IER_RCOMP_MASK | AVR32_MACB_IER_TCOMP_MASK;
    }
    portEXIT_CRITICAL();
  }
}

/*
 * The following functions are initialisation functions taken from the Atmel
 * EMAC sample code.
 */
static portBASE_TYPE prvProbePHY( void )
{
unsigned long mii_status, advertise, lpa, phy_ctrl;
unsigned long config;
unsigned long upper, lower,mode;
unsigned long physID;

  /* Read Phy Identifier register 1 & 2 */
  lower = vReadPHY(PHY_PHYSID2);
  upper = vReadPHY(PHY_PHYSID1);
  /* get Phy ID, ignore Revision */
  physID = ((upper << 16) & 0xFFFF0000) | (lower & 0xFFF0);
  /* check if it match config */
  if (physID == MII_DP83848_ID)
  {
    /* read RBR */
    mode = vReadPHY(PHY_RBR);
    /* set RMII mode if not done */
    if ((mode & RBR_RMII) != RBR_RMII)
    {
      /* force RMII flag if strap options are wrong */
      mode |= RBR_RMII;
    vWritePHY(PHY_RBR,mode);
    }

    /* set advertise register */
#if ETHERNET_CONF_AN_ENABLE == 1
    advertise = ADVERTISE_CSMA | ADVERTISE_ALL;
#else
    advertise = ADVERTISE_CSMA;
    #if ETHERNET_CONF_USE_100MB
      #if ETHERNET_CONF_USE_FULL_DUPLEX
        advertise |= ADVERTISE_100FULL;
      #else
        advertise |= ADVERTISE_100HALF;
      #endif
    #else
      #if ETHERNET_CONF_USE_FULL_DUPLEX
        advertise |= ADVERTISE_10FULL;
      #else
        advertise |= ADVERTISE_10HALF;
      #endif
    #endif
#endif
    /* write advertise register */
    vWritePHY(PHY_ADVERTISE, advertise);
    /* read Control register */
    config = vReadPHY(PHY_BMCR);
    /* read Phy Control register */
    phy_ctrl = vReadPHY(PHY_PHYCR);
#if ETHERNET_CONF_AN_ENABLE
  #if ETHERNET_CONF_AUTO_CROSS_ENABLE
    /* enable Auto MDIX */
    phy_ctrl |= PHYCR_MDIX_EN;
  #else
    /* disable Auto MDIX */
    phy_ctrl &= ~PHYCR_MDIX_EN;
    #if ETHERNET_CONF_CROSSED_LINK
      /* force direct link = Use crossed RJ45 cable */
      phy_ctrl &= ~PHYCR_MDIX_FORCE;
    #else
      /* force crossed link = Use direct RJ45 cable */
      phy_ctrl |= PHYCR_MDIX_FORCE;
    #endif
  #endif
  /* reset auto-negociation capability */
  config |= (BMCR_ANRESTART | BMCR_ANENABLE);
#else
  /* disable Auto MDIX */
  phy_ctrl &= ~PHYCR_MDIX_EN;
  #if ETHERNET_CONF_CROSSED_LINK
    /* force direct link = Use crossed RJ45 cable */
    phy_ctrl &= ~PHYCR_MDIX_FORCE;
  #else
    /* force crossed link = Use direct RJ45 cable */
    phy_ctrl |= PHYCR_MDIX_FORCE;
  #endif
  /* clear AN bit */
  config &= ~BMCR_ANENABLE;

  #if ETHERNET_CONF_USE_100MB
    config |= BMCR_SPEED100;
  #else
    config &= ~BMCR_SPEED100;
  #endif
  #if ETHERNET_CONF_USE_FULL_DUPLEX
    config |= BMCR_FULLDPLX;
  #else
    config &= ~BMCR_FULLDPLX;
  #endif
#endif
    /* update Phy ctrl register */
    vWritePHY(PHY_PHYCR, phy_ctrl);

    /* update ctrl register */
    vWritePHY(PHY_BMCR, config);

    /* loop while link status isn't OK */
    do {
      mii_status = vReadPHY(PHY_BMSR);
    } while (!(mii_status & BMSR_LSTATUS));

    /* read the LPA configuration of the PHY */
    lpa = vReadPHY(PHY_LPA);

    /* read the MACB config register */
    config = AVR32_MACB.ncfgr;

    /* if 100MB needed */
    if ((lpa & advertise) & (LPA_100HALF | LPA_100FULL))
    {
      config |= AVR32_MACB_SPD_MASK;
    }
    else
    {
      config &= ~(AVR32_MACB_SPD_MASK);
    }

    /* if FULL DUPLEX needed */
    if ((lpa & advertise) & (LPA_10FULL | LPA_100FULL))
    {
      config |= AVR32_MACB_FD_MASK;
    }
    else
    {
      config &= ~(AVR32_MACB_FD_MASK);
    }

    /* write the MACB config register */
    AVR32_MACB.ncfgr = config;

    return pdPASS;
  }
  return pdFAIL;
}

static unsigned portLONG vReadPHY( unsigned portCHAR ucAddress )
{
 unsigned portLONG pulValue;

  /* Enable management port */
  AVR32_MACB.ncr |= AVR32_MACB_NCR_MPE_MASK;

