FreeRTOS/FreeRTOS/Demo/lwIP_AVR32_UC3/NETWORK/EMAC/AVR32_EMAC.c
  /* configure MDIO frame in MAN register */
  AVR32_MACB.man =  (AVR32_MACB_SOF_MASK & (0x01<<AVR32_MACB_SOF_OFFSET))  // SOF
                    | (2 << AVR32_MACB_CODE_OFFSET)                        // Code
                    | (2 << AVR32_MACB_RW_OFFSET)                          // Read operation
                    | ((DP83848_PHY_ADDR & 0x1f) << AVR32_MACB_PHYA_OFFSET)  // Phy Add
                    | (ucAddress << AVR32_MACB_REGA_OFFSET);               // Reg Add

  /* Wait until IDLE bit in Network Status register is cleared. */
  while( !( AVR32_MACB.nsr & AVR32_MACB_NSR_IDLE_MASK ) )
  {
    __asm( "NOP" );
  }

  pulValue = (AVR32_MACB.man  & 0x0000ffff );

  /* Disable management port */
  AVR32_MACB.ncr &= ~AVR32_MACB_NCR_MPE_MASK;

  return (pulValue);
}


static void vWritePHY( unsigned portCHAR ucAddress, unsigned portLONG ulValue )
{
  /* Enable management port */
  AVR32_MACB.ncr |= AVR32_MACB_NCR_MPE_MASK;

  /* configure MDIO frame in MAN register */
  AVR32_MACB.man = (( AVR32_MACB_SOF_MASK & (0x01<<AVR32_MACB_SOF_OFFSET)) // SOF
                  | (2 << AVR32_MACB_CODE_OFFSET)                          // Code
                  | (1 << AVR32_MACB_RW_OFFSET)                            // Write operation
                  | ((DP83848_PHY_ADDR & 0x1f) << AVR32_MACB_PHYA_OFFSET)    // Phy Add
                  | (ucAddress << AVR32_MACB_REGA_OFFSET))                 // Reg Add
                  | (ulValue & 0xffff);                                    // Data

  /* Wait until IDLE bit in Network Status register is cleared */
  while( !( AVR32_MACB.nsr & AVR32_MACB_NSR_IDLE_MASK ) )
  {
    __asm( "NOP" );
  };

  /* Disable management port */
  AVR32_MACB.ncr &= ~AVR32_MACB_NCR_MPE_MASK;

}

void vEMACWaitForInput( void )
{
  /* Just wait until we are signled from an ISR that data is available, or
  we simply time out. */
  xSemaphoreTake( xSemaphore, emacBLOCK_TIME_WAITING_FOR_INPUT );
}
